# Taps
tap "microsoft/git"

# CLI Tools
brew "bat"
brew "bat-extras"
brew "cargo-c" unless ENV['CODESPACES']
brew "clipboard"
brew "curl"
brew "curlie"
brew "diff-so-fancy"
brew "diffnav"
brew "difftastic"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go" unless ENV['CODESPACES']
brew "gum"
brew "highlight"
brew "htop"
brew "httpie"
brew "jq"
brew "jsonlint"
brew "lua-language-server"
brew "luarocks" unless ENV['CODESPACES']
brew "neovim"
brew "node" unless ENV['CODESPACES']
brew "nowplaying-cli" if OS.mac?
brew "nvm" unless ENV['CODESPACES']
brew "postgresql" unless ENV['CODESPACES']
brew "prettierd"
brew "pyenv" unless ENV['CODESPACES']
brew "qemu" unless ENV['CODESPACES']
brew "readline"
brew "ripgrep"
brew "ripgrep-all"
brew "rust" unless ENV['CODESPACES']
brew "selene"
brew "shellcheck"
brew "sqlite3"
brew "starship"
brew "stow"
brew "tcl-tk"
brew "tmux"
brew "wget"
brew "xz"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zsh"

# Cask Applications (skipped in Codespaces)
unless ENV['CODESPACES']
  cask "aerospace" if OS.mac?
  cask "figma"
  cask "font-3270-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
  cask "font-monaspice-nerd-font"
  cask "font-sf-pro" if OS.mac?
  cask "ghostty"
  cask "google-chrome"
  cask "imageoptim" if OS.mac?
  cask "insomnia"
  cask "keycastr" if OS.mac?
  cask "kitty"
  cask "obsidian"
  cask "pgadmin4"
  cask "sf-symbols" if OS.mac?
  cask "spotify"
  cask "visual-studio-code"
  cask "zoom"
end
