# Taps
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "laishulu/homebrew"
tap "microsoft/git"
tap "nikitabobko/tap"

# CLI Tools
brew "bat"
brew "bat-extras"
brew "cargo-c"
brew "clipboard"
brew "curl"
brew "curlie"
brew "diff-so-fancy"
brew "diffnav"
brew "difftastic"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "gum"
brew "htop"
brew "httpie"
brew "jq"
brew "jsonlint"
brew "lua-language-server"
brew "luarocks"
brew "macism"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "nvm"
brew "postgresql"
brew "prettierd"
brew "pyenv"
brew "qemu"
brew "readline"
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "selene"
brew "starship"
brew "shellcheck"
brew "sqlite3"
brew "stow"
brew "tcl-tk"
brew "tmux"
brew "wget"
brew "xz"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "zlib"
brew "zoxide"

# Cask Applications
cask "aerospace"
cask "figma"
cask "font-3270-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-sf-pro"
cask "ghostty"
cask "google-chrome"
cask "imageoptim"
cask "insomnia"
cask "keycastr"
cask "kitty"
cask "obsidian"
cask "pgadmin4"
cask "sf-symbols"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
